tap "homebrew/bundle"
tap "gitguardian/tap"
tap "FelixKratz/formulae" # for sketchybar

# -- CLI --
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "tmux"
brew "fzf"
brew "btop"
brew "fx"
brew "bat"            # better `cat`
brew "tldr"           # simplified man pages
brew "grep"           # text searching
brew "rg"             # for better files searches (also used by nvim)
brew "eza"
brew "neovim"		  # höö ?
brew "starship"      # Shell prompt
brew 'zoxide'
brew 'sketchybar' # make sure to run 'brew services start sketchybar'

# -- CLI: Dev & Build Tools --
brew "git"
brew "go"
brew "python"
brew "xcodegen"
brew "ansible"      
brew "lazygit"
brew "delve" # Go Debugger used in nvim (DAP)

# -- CLI: Networking & Package Management --
brew "curl"
brew "wget"
brew "httpie"
brew "mas"            # Mac App Store CLI

# Formatter tools used in neovim plugins
brew "prettier"		  # JS/TS formatter
brew "swiftformat"
brew "swiftlint"
brew "xcbeautify"

# -- Apps --
cask "iterm2"
cask "wezterm"
cask "docker-desktop"
cask "mitmproxy"
cask "sourcetree"
cask "tailscale-app"

cask "postman"
cask "sublime-text"
cask "xcodes-app"

cask "raycast"
cask "notion"
cask "google-chrome"
cask "termius"
cask "rectangle"       # Window management
cask "shortcat"
cask "alt-tab"
cask "nikitabobko/tap/aerospace"

# -- Mac App Store --
mas "Swift Playgrounds", id: 1496833156
mas "Xcode", id: 497799835
