tap "homebrew/bundle"
tap "gitguardian/tap"
tap "FelixKratz/formulae"   # for sketchybar
tap "sst/tap"               # for opencode
tap "nikitabobko/tap"       # for aerospace

# ───────────────────────────────
# CLI Utilities
# ───────────────────────────────

# Enhanced Unix Tools
brew "bat"                  # better cat
brew "eza"                  # better ls
brew "grep"                 # text search
brew "rg"                   # file search (used by nvim)
brew "fzf"                  # fuzzy finder
brew "zoxide"               # fast cd
brew "imagemagick"          # image processing
brew "ghostscript"          # pdf processing
brew "fd"                   # find alternative
brew "git-delta"            # better git diff

# System & Network
brew "btop"                 # system monitor
brew "nmap"                 # network scanner
brew "curl"                 # http client
brew "wget"                 # file downloader

# Data & Text Processing
brew "jq"                   # json processor
brew "fx"                   # json viewer

# Shell Enhancement
brew "starship"             # shell prompt
brew "thefuck"              # fix typos
brew "tldr"                 # short man pages
brew "zsh-autosuggestions"  # zsh helper
brew "zsh-syntax-highlighting" # zsh colors
brew "zsh-completions"      # zsh completions
brew "zsh-autocomplete"     # zsh autocomplete

# Core Dev Tools
brew "neovim"               # editor
brew "tmux"                 # terminal multiplexer
brew "lazygit"              # git ui
brew "delta"                # git diff tool
brew "opencode"             # ai code cli
brew "copilot"              # ai code cli
# llm models default openrouter/openrouter/free - to simply use this as default with just llm "hi"
brew "llm"                  # ai code cli

# Security
brew "pass"                 # password manager
brew "gpg"                  # encryption tool for pass
brew "openssh"              # ssh tool

# ───────────────────────────────
# Dev & Build Tools
# ───────────────────────────────
brew "ansible"              # automation
brew "delve"                # go debugger (nvim DAP)
brew "git"                  # version control
brew "go"                   # go lang
brew "python"               # scripting
brew "xcodegen"             # xcode project gen
brew "ruby"                 # ruby lang
brew "luarocks"             # lua package manager

# all those below are required by xcodebuild.nvim. Some might have been listed above already.
brew "xcode-build-server"   # xcode lsp server
brew "xcbeautify"           # xcode build formatter
brew "ruby"                 # ruby lang (duplicate)
brew "pipx"                 # python package installer
brew "rg"                   # file search (duplicate)
brew "jq"                   # json processor (duplicate)
brew "coreutils"            # gnu core utilities

# Database Tools
# make sure to run "brew link --force libpq" afterwards
brew "postgresql"            # postgres databas
brew "libpq"                # postgres tools

# ───────────────────────────────
# Formatter & Linter Tools
# ───────────────────────────────
brew "prettier"             # JS/TS formatter
brew "swiftformat"          # swift formatter
brew "swiftlint"            # swift linter
brew "xcbeautify"           # xcode build formatter (duplicate)

# ───────────────────────────────
# Desktop UI & Automation
# ───────────────────────────────
# sketchybars and borders are started with aerospace.
# Otherwise manually run:
#   brew services start sketchybar
#   brew services start borders
brew "borders"              # window borders
brew "sketchybar"           # status bar

# ───────────────────────────────
# Applications (Casks)
# ───────────────────────────────
cask "iterm2"               # terminal emulator
cask "wezterm"              # gpu terminal
cask "ghostty"              # fast terminal
cask "docker-desktop"       # container platform
cask "mitmproxy"            # http proxy
cask "fork"                 # git gui
cask "tailscale-app"        # vpn mesh network

cask "postman"              # api client
cask "sublime-text"         # text editor
cask "xcodes-app"           # xcode version manager
cask "swiftformat-for-xcode" # xcode swift formatter

cask "raycast"              # spotlight replacement
cask "notion"               # note taking
cask "google-chrome"        # web browser
cask "shortcat"             # mouse-free navigation
cask "aerospace"            # tiling window manager
